requests/multiroom_action3.xml

<ns0:Envelope xmlns:ns0="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.deltasolutions.ru/om/rt/LyraOmsService/">
    <ns0:Header />
    <ns0:Body>
        <ns1:SubmitOrderRequest>
            <Components>
                
                <Component>
                    <Attributes>
						<Attribute>
                            <Name>cfs_spec_id</Name>
                            <Value>multiroom</Value>
                        </Attribute>
						<Attribute>
                            <Name>street</Name>
                            <Value>301</Value>
                        </Attribute>
						<Attribute>
                            <Name>house</Name>
                            <Value>12</Value>
                        </Attribute>
						<Attribute>
                            <Name>flat</Name>
                            <Value>11</Value>
                        </Attribute>
						<Attribute>
                            <Name>client_name</Name>
                            <Value>АННЕНКОВА СВЕТЛАНА ВИКТОРОВНА</Value>
                        </Attribute>
						<Attribute>
                            <Name>client_type</Name>
                            <Value>3</Value>
                        </Attribute>
						<Attribute>
                            <Name>contract_id</Name>
                            <Value>4933133</Value>
                        </Attribute>
						<Attribute>
                            <Name>parent_virtual_number</Name>
                            <Value>77059187261</Value>
                        </Attribute>
						<Attribute>
                            <Name>connection_scheme</Name>
                            <Value>187</Value>
                        </Attribute>
						<Attribute>
                            <Name>action_code</Name>
                            <Value>3</Value>
                        </Attribute>
						<Attribute>
                            <Name>lyra_service_code</Name>
                            <Value>179900</Value>
                        </Attribute>
						<Attribute>
                            <Name>nri_rnabn</Name>
                            <Value>10437873</Value>
                        </Attribute>
						<Attribute>
                            <Name>instance_id</Name>
                            <Value>67517595</Value>
                        </Attribute>
						<Attribute>
                            <Name>exec_date</Name>
                            <Value>2015-07-15T00:00:00+06:00</Value>
                        </Attribute>
						<Attribute>
                            <Name>delivery_date</Name>
                            <Value>2015-07-15T00:00:00+06:00</Value>
                        </Attribute>
						
						<Attribute>
                            <Name>need_installation</Name>
                            <Value>1</Value>
                        </Attribute>
						<Attribute>
                            <Name>installation_order_id</Name>
                            <Value>190</Value>
                        </Attribute>
						<Attribute>
                            <Name>installation_date</Name>
                            <Value>2015-07-03T00:00:00+06:00</Value>
                        </Attribute>
                        <Attribute>
                            <Name>installation_interval</Name>
                            <Value>10:00-12:00</Value>
                        </Attribute>
						<Attribute>
                            <Name>service_reciever</Name>
                            <Value>2</Value>
                        </Attribute>
						<Attribute>
                            <Name>technology</Name>
                            <Value>xPON</Value>
                        </Attribute>
						<Attribute>
                            <Name>order_start_date</Name>
                            <Value>2015-07-15T00:00:00+06:00</Value>
                        </Attribute>
                        <Attribute>
                            <Name>order_action_type</Name>
                            <Value>CH</Value>
                        </Attribute>
						<Attribute>
                            <Name>prcl_id</Name>
                            <Value>56000</Value>
                        </Attribute>
						<Attribute>
                            <Name>rtpl_id</Name>
                            <Value>34000</Value>
                        </Attribute>
						<Attribute>
                            <Name>tx_id</Name>
                            <Value>1100</Value>
                        </Attribute>
						<Attribute>
                            <Name>city</Name>
                            <Value>10001</Value>
                        </Attribute>
						<Attribute>
                            <Name>department_id</Name>
                            <Value>4013</Value>
                        </Attribute>
						<Attribute>
                            <Name>client_id</Name>
                            <Value>32535777</Value>
                        </Attribute>
						
                    <Attribute>
                            <Name>service_receiver</Name>
                            <Value>2</Value>
                        </Attribute>
						</Attributes>
                </Component>
            </Components>
            <CommonData>
                <Attributes>
                    <Attribute>
                        <Name>main_virtual_number</Name>
                        <Value>3422363257</Value>
                    </Attribute>
                </Attributes>   
            </CommonData>
        </ns1:SubmitOrderRequest>
    </ns0:Body>
</ns0:Envelope>